Autodesk.Revit.DB.Geolocation.GeolocationBase.GetGeoCoordinateSystem(Autodesk.Revit.DB.Geolocation.CrsEncodingType)
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Geolocation.GeolocationBase.SetJsonRepresentation(Autodesk.Revit.DB.Geolocation.GeolocationJsonRecord)
sets the JsonRecord representing this location.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Geolocation.GeolocationBase.GetJsonRepresentation
returns a copy of the JsonRecord representing the location.

Autodesk.Revit.DB.Geolocation.GeolocationBase.GetLinearUnit
The linearUnit the associated Geolocation is defined in.

Autodesk.Revit.DB.Geolocation.GeolocationBase.GetReferenceId
string representing reference id used in referencing the Geolocation Json

Autodesk.Revit.DB.Geolocation.GeolocationBase.GetJson
Json string representation of the geographic location.

Autodesk.Revit.DB.Geolocation.GeolocationBase.AddFitPoint(Autodesk.Revit.DB.XYZ)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Geolocation.GeolocationBase.SetExtent(Autodesk.Revit.DB.Geolocation.GeolocationBoundingBox)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Geolocation.GeolocationBase.AddPrimaryCRS(Autodesk.Revit.DB.Geolocation.CrsEncodingType,System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Geolocation.GeolocationBase.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Geolocation.GeolocationBase
Base class for all classes participating in the new Geolocation workflows.
The classes are setup to follow the structure of the Geospatial AECDM schema
as closely as possible.